Revit 2024 API
EnergyAnalysisSurface.SurfaceId Property
 The unique identifier for the surface.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string SurfaceId { get; }
Visual Basic
Public ReadOnly Property SurfaceId As String
	Get
Visual C++
public:
property String^ SurfaceId {
	String^ get ();
}
Remarks
 This identification attribute is composed of the prefix "su" and a sequential number, separated by "-". A sample value would be "su-1".
See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace